In [83]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

In [84]:
#veri setimiz virgül yada noktalı virgül ile ayrılmadığından boşluklarla ayrıldığından delim_whitespace kullandık bu metod sadece bir boşluk değil birden fazla boşluk olsada dataları ayırır
#on_bad_lines ile bazı verilere fazladan olmayan sütun değeri atanmış bunları çıkardık
data=pd.read_csv('marketing_campaign.csv',delim_whitespace=True,on_bad_lines='skip')
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1.0
1,2174,1954,Graduation,Single,46344,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0.0
2,4141,1965,Graduation,Together,71613,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0.0
3,6182,1984,Graduation,Together,26646,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0.0
4,5324,1981,PhD,Married,58293,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0.0

In [85]:
data.shape

(2040, 29)

In [86]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2040 entries, 0 to 2039
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2040 non-null   int64
 1   Year_Birth           2040 non-null   int64
 2   Education            2040 non-null   object
 3   Marital_Status       2040 non-null   object
 4   Income               2040 non-null   object
 5   Kidhome              2040 non-null   int64
 6   Teenhome             2040 non-null   object
 7   Dt_Customer          2040 non-null   object
 8   Recency              2040 non-null   int64
 9   MntWines             2040 non-null   int64
 10  MntFruits            2040 non-null   int64
 11  MntMeatProducts      2040 non-null   int64
 12  MntFishProducts      2040 non-null   int64
 13  MntSweetProducts     2040 non-null   int64
 14  MntGoldProds         2040 non-null   int64
 15  NumDealsPurchases    2040 non-null   int64
 16  NumWebPurchases      2040 non-null   int64
 17  NumCatalogPurchases  2040 non-null   int64
 18  NumStorePurchases    2040 non-null   int64
 19  NumWebVisitsMonth    2040 non-null   int64
 20  AcceptedCmp3         2040 non-null   int64
 21  AcceptedCmp4         2040 non-null   int64
 22  AcceptedCmp5         2040 non-null   int64
 23  AcceptedCmp1         2040 non-null   int64
 24  AcceptedCmp2         2040 non-null   int64
 25  Complain             2040 non-null   int64
 26  Z_CostContact        2040 non-null   int64
 27  Z_Revenue            2040 non-null   int64
 28  Response             2019 non-null   float64
dtypes: float64(1), int64(23), object(5)
memory usage: 462.3+ KB

In [87]:
data.describe()

,ID,Year_Birth,Kidhome,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
count,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,...,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2040.000000,2019.000000
mean,5595.943627,1968.489706,0.440686,50.837255,312.000980,26.855392,169.277941,36.541667,26.518627,43.210294,...,5.250000,0.073529,0.076961,0.075490,0.062745,0.013725,0.039216,3.082353,10.887255,0.154037
std,3249.676614,11.790300,0.538295,41.680856,341.644224,43.187459,228.263721,53.806332,40.854683,51.560698,...,2.493788,0.261068,0.266595,0.264245,0.242563,0.116378,0.315422,0.807689,1.105976,0.361073
min,0.000000,1899.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.000000,0.000000,0.000000
25%,2834.750000,1959.000000,0.000000,24.000000,25.000000,1.000000,16.000000,2.000000,1.000000,8.000000,...,3.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.000000,11.000000,0.000000
50%,5492.000000,1970.000000,0.000000,50.000000,182.000000,8.000000,68.000000,12.000000,8.000000,23.500000,...,6.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.000000,11.000000,0.000000
75%,8439.750000,1977.000000,1.000000,74.000000,514.250000,33.000000,235.000000,49.000000,33.000000,55.000000,...,7.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.000000,11.000000,0.000000
max,11191.000000,1996.000000,2.000000,861.000000,1493.000000,490.000000,1725.000000,263.000000,362.000000,321.000000,...,20.000000,1.000000,1.000000,1.000000,1.000000,1.000000,3.000000,11.000000,11.000000,1.000000

In [88]:
data.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'],
      dtype='object')

In [89]:
data.isnull().sum()

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                  0
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response               21
dtype: int64

In [90]:
data = data.dropna(subset=['Response']) #boş sütunları sildik zaten 21 tane %1-%2 arasında
data.isnull().sum()

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

In [91]:
#numeric olmayan kolonlar
non_numeric_columns=data.select_dtypes(exclude=['number']).columns
print(non_numeric_columns)

Index(['Education', 'Marital_Status', 'Income', 'Teenhome', 'Dt_Customer'], dtype='object')

In [92]:
#uniqe değerleri belirledik bunları sayısal değerlere dönüştüreceğiz
for item in non_numeric_columns:
    print(data[item].unique())

['Graduation' 'PhD' 'Master' 'Basic' '2n']
['Single' 'Together' 'Married' 'Divorced' 'Widow' 'Cycle' 'Alone' 'Absurd'
 'YOLO']
['58138' '46344' '71613' ... '56981' '69245' '52869']
['0' '1' '2']
['04-09-2012' '08-03-2014' '21-08-2013' '10-02-2014' '19-01-2014'
 '09-09-2013' '13-11-2012' '08-05-2013' '06-06-2013' '13-03-2014'
 '15-11-2013' '10-10-2012' '24-11-2012' '24-12-2012' '31-08-2012'
 '28-03-2013' '08-08-2012' '06-01-2013' '23-12-2012' '11-01-2014'
 '18-03-2013' '02-01-2013' '27-05-2013' '31-05-2013' '22-11-2013'
 '22-05-2014' '11-05-2013' '29-10-2012' '20-02-2013' '29-08-2013'
 '31-12-2013' '11-02-2014' '01-02-2013' '29-04-2013' '12-03-2013'
 '02-10-2013' '28-06-2014' '24-05-2013' '08-11-2012' '12-05-2014'
 '11-08-2012' '07-06-2014' '12-06-2013' '19-11-2012' '02-04-2013'
 '28-04-2014' '03-03-2014' '04-07-2013' '07-09-2012' '18-02-2013'
 '11-06-2013' '06-12-2013' '21-05-2013' '11-05-2014' '27-09-2013'
 '08-04-2013' '11-09-2012' '14-09-2012' '17-03-2013' '05-04-2013'
 '30-04-2014' '19-12-2012' '27-08-2012' '12-10-2012' '29-08-2012'
 '23-06-2013' '25-02-2014' '11-08-2013' '16-07-2013' '28-05-2014'
 '21-01-2014' '23-03-2014' '24-05-2014' '22-11-2012' '11-04-2013'
 '20-06-2013' '30-03-2014' '20-04-2013' '17-05-2013' '08-05-2014'
 '10-12-2013' '24-09-2013' '02-02-2013' '07-12-2012' '02-11-2013'
 '10-11-2012' '25-06-2014' '12-12-2012' '10-09-2013' '24-01-2014'
 '14-11-2013' '24-02-2014' '04-09-2013' '22-04-2013' '21-04-2013'
 '08-06-2014' '10-05-2014' '30-09-2013' '10-03-2013' '14-08-2013'
 '07-07-2013' '19-05-2014' '28-07-2013' '19-10-2012' '19-04-2013'
 '28-08-2013' '19-03-2013' '18-10-2012' '28-10-2012' '21-06-2014'
 '24-04-2014' '07-03-2014' '09-10-2012' '19-02-2013' '08-07-2013'
 '12-09-2013' '17-10-2013' '20-08-2013' '01-07-2013' '05-11-2012'
 '05-01-2014' '01-05-2013' '01-03-2014' '13-11-2013' '18-11-2013'
 '21-04-2014' '13-07-2013' '30-01-2014' '04-04-2014' '12-09-2012'
 '16-12-2012' '23-05-2014' '24-06-2014' '28-09-2013' '22-01-2014'
 '15-06-2014' '05-12-2012' '02-08-2013' '23-02-2013' '09-09-2012'
 '30-05-2013' '29-12-2013' '13-05-2014' '19-09-2013' '17-01-2013'
 '31-03-2014' '29-06-2014' '09-12-2013' '14-10-2013' '02-11-2012'
 '17-07-2013' '08-12-2013' '13-05-2013' '10-09-2012' '31-03-2013'
 '18-03-2014' '05-10-2012' '21-01-2013' '04-05-2013' '01-04-2014'
 '31-08-2013' '14-11-2012' '14-04-2014' '05-01-2013' '08-09-2012'
 '26-03-2013' '25-10-2012' '09-12-2012' '16-02-2014' '20-03-2013'
 '15-05-2013' '16-04-2014' '23-03-2013' '04-12-2013' '04-10-2013'
 '26-12-2013' '28-10-2013' '31-07-2013' '28-11-2013' '17-08-2012'
 '05-06-2014' '20-05-2013' '09-01-2013' '16-09-2013' '27-10-2013'
 '13-10-2012' '16-10-2012' '22-10-2012' '04-06-2013' '22-05-2013'
 '17-06-2014' '23-11-2012' '03-02-2013' '14-03-2013' '26-06-2014'
 '15-10-2012' '19-06-2013' '22-09-2012' '20-03-2014' '04-02-2014'
 '06-04-2014' '06-02-2013' '11-02-2013' '17-04-2014' '12-07-2013'
 '29-01-2013' '08-01-2013' '13-06-2013' '27-12-2013' '31-10-2012'
 '15-01-2014' '23-08-2012' '13-01-2013' '12-01-2013' '17-03-2014'
 '13-04-2014' '18-09-2012' '05-03-2014' '27-04-2013' '18-01-2014'
 '17-12-2013' '11-03-2014' '29-07-2013' '14-08-2012' '09-02-2014'
 '07-02-2013' '11-01-2013' '05-07-2013' '02-07-2013' '07-11-2013'
 '09-05-2013' '13-02-2013' '16-04-2013' '11-09-2013' '03-04-2013'
 '10-01-2013' '30-06-2013' '06-12-2012' '12-11-2012' '03-03-2013'
 '26-09-2013' '10-08-2012' '07-12-2013' '15-08-2013' '10-11-2013'
 '16-06-2014' '25-12-2012' '03-01-2014' '27-10-2012' '22-12-2012'
 '29-11-2013' '08-10-2013' '28-09-2012' '22-03-2014' '28-12-2012'
 '21-08-2012' '16-03-2013' '17-11-2012' '01-12-2012' '11-11-2012'
 '22-06-2013' '18-08-2012' '30-12-2012' '14-06-2013' '16-10-2013'
 '30-08-2012' '04-05-2014' '18-04-2013' '06-10-2013' '15-09-2012'
 '27-09-2012' '11-03-2013' '22-10-2013' '09-06-2014' '30-05-2014'
 '17-10-2012' '09-11-2012' '30-03-2013' '22-08-2012' '23-01-2013'
 '14-02-2014' '22-02-2013' '05-03-2013' '06-05-2014' '13-04-2013'
 '05-04-2014' '25-04-2013' '25-11-2013' '02-02-2014' '21-06-2013'
 '21-12-2013' '07-09-2013' '22-08-2013' '20-12-2013' '06-08-2013'
 '09-10-2013' '09-06-2013' '22-12-2013' '02-05-2013' '16-02-2013'
 '20-08-2012' '01-04-2013' '25-05-2014' '01-01-2014' '22-09-2013'
 '28-01-2014' '23-04-2013' '06-03-2014' '15-08-2012' '27-03-2013'
 '10-10-2013' '04-08-2012' '18-05-2014' '09-05-2014' '23-10-2012'
 '30-12-2013' '19-08-2012' '30-10-2013' '26-06-2013' '26-01-2014'
 '24-09-2012' '03-12-2012' '27-11-2013' '06-08-2012' '29-12-2012'
 '24-08-2012' '07-11-2012' '02-12-2013' '19-07-2013' '25-05-2013'
 '20-10-2013' '14-04-2013' '23-08-2013' '27-01-2014' '16-08-2013'
 '30-09-2012' '04-12-2012' '12-08-2012' '03-11-2013' '18-09-2013'
 '18-06-2014' '24-04-2013' '17-06-2013' '15-02-2014' '23-12-2013'
 '28-11-2012' '07-08-2013' '07-01-2014' '03-12-2013' '29-03-2014'
 '08-04-2014' '07-02-2014' '06-11-2013' '01-03-2013' '16-06-2013'
 '25-06-2013' '05-11-2013' '01-08-2013' '31-01-2013' '09-07-2013'
 '15-04-2013' '03-04-2014' '23-09-2012' '14-09-2013' '17-05-2014'
 '26-10-2012' '19-10-2013' '21-02-2013' '17-09-2013' '26-01-2013'
 '07-05-2014' '19-08-2013' '18-07-2013' '11-12-2012' '26-07-2013'
 '06-05-2013' '03-06-2013' '11-07-2013' '14-07-2013' '10-03-2014'
 '20-01-2013' '21-09-2012' '06-09-2012' '18-12-2012' '19-11-2013'
 '13-06-2014' '07-05-2013' '18-08-2013' '13-12-2013' '17-02-2014'
 '03-08-2012' '04-01-2014' '21-10-2013' '25-12-2013' '01-01-2013'
 '16-05-2013' '25-09-2013' '08-11-2013' '16-12-2013' '30-10-2012'
 '02-01-2014' '18-10-2013' '24-10-2013' '19-12-2013' '07-03-2013'
 '16-05-2014' '04-10-2012' '25-08-2013' '29-05-2013' '26-03-2014'
 '09-04-2014' '12-03-2014' '29-04-2014' '27-06-2014' '10-04-2013'
 '21-11-2013' '21-10-2012' '14-05-2013' '01-08-2012' '23-11-2013'
 '25-01-2014' '11-10-2013' '07-08-2012' '29-03-2013' '03-06-2014'
 '09-08-2012' '06-03-2013' '12-05-2013' '09-03-2014' '15-09-2013'
 '03-10-2013' '28-02-2013' '02-05-2014' '15-03-2013' '10-05-2013'
 '05-09-2012' '26-05-2013' '03-07-2013' '12-12-2013' '08-12-2012'
 '30-08-2013' '18-12-2013' '19-03-2014' '18-06-2013' '29-05-2014'
 '15-01-2013' '29-10-2013' '02-03-2013' '14-12-2013' '19-01-2013'
 '06-04-2013' '04-11-2013' '22-03-2013' '31-05-2014' '04-02-2013'
 '05-05-2013' '08-08-2013' '14-02-2013' '21-03-2014' '05-08-2013'
 '29-11-2012' '13-01-2014' '23-10-2013' '26-05-2014' '04-03-2014'
 '06-01-2014' '11-06-2014' '23-07-2013' '26-11-2012' '11-12-2013'
 '09-02-2013' '14-01-2014' '23-01-2014' '24-03-2013' '29-06-2013'
 '25-01-2013' '18-05-2013' '17-04-2013' '24-01-2013' '17-11-2013'
 '09-08-2013' '20-07-2013' '28-05-2013' '04-03-2013' '01-10-2012'
 '10-02-2013' '14-10-2012' '03-02-2014' '22-06-2014' '25-10-2013'
 '18-02-2014' '09-11-2013' '13-08-2013' '25-08-2012' '18-04-2014'
 '19-04-2014' '03-01-2013' '19-06-2014' '03-11-2012' '26-02-2014'
 '23-04-2014' '30-07-2013' '13-10-2013' '27-11-2012' '25-07-2013'
 '11-04-2014' '01-05-2014' '30-11-2012' '17-08-2013' '12-10-2013'
 '04-01-2013' '03-05-2014' '26-04-2014' '02-06-2014' '26-10-2013'
 '24-03-2014' '25-02-2013' '20-09-2013' '16-01-2013' '24-12-2013'
 '18-11-2012' '05-08-2012' '03-05-2013' '12-11-2013' '06-07-2013'
 '21-07-2013' '20-10-2012' '23-05-2013' '26-08-2012' '12-01-2014'
 '13-02-2014' '20-04-2014' '28-06-2013' '28-04-2013' '15-02-2013'
 '21-03-2013' '27-08-2013' '30-07-2012' '05-12-2013' '08-02-2013'
 '07-04-2014' '22-01-2013' '21-11-2012' '26-02-2013' '20-09-2012'
 '05-09-2013' '12-04-2014' '24-06-2013' '19-02-2014' '27-12-2012'
 '01-11-2012' '22-07-2013' '31-01-2014' '26-08-2013' '01-10-2013'
 '01-02-2014' '03-09-2012' '26-09-2012' '02-12-2012' '05-05-2014'
 '06-10-2012' '02-03-2014' '15-05-2014' '10-12-2012' '13-08-2012'
 '10-06-2013' '23-02-2014' '16-03-2014' '21-09-2013' '24-10-2012'
 '15-10-2013' '17-02-2013' '28-08-2012' '12-02-2014' '08-02-2014'
 '01-09-2012' '16-11-2012' '12-02-2013' '10-06-2014' '27-07-2013'
 '01-12-2013' '16-08-2012' '08-06-2013' '25-11-2012' '27-04-2014'
 '20-11-2012' '14-06-2014' '28-03-2014' '08-03-2013' '02-09-2012'
 '15-04-2014' '25-04-2014' '27-06-2013' '01-06-2013' '05-10-2013'
 '22-02-2014' '12-04-2013' '23-09-2013' '23-06-2014' '10-01-2014'
 '25-03-2013' '17-01-2014' '04-06-2014' '25-03-2014' '31-12-2012'
 '27-02-2013' '20-11-2013' '02-10-2012' '09-04-2013' '02-04-2014'
 '07-01-2013' '26-11-2013' '04-08-2013' '17-12-2012' '06-06-2014'
 '19-05-2013' '12-08-2013' '07-10-2012' '06-09-2013' '15-07-2013'
 '27-01-2013' '05-02-2014' '26-12-2012' '06-02-2014' '14-01-2013'
 '20-06-2014' '24-08-2013' '28-02-2014' '07-04-2013' '10-04-2014'
 '12-06-2014' '25-09-2012' '30-11-2013' '09-03-2013' '27-03-2014'
 '29-09-2012' '15-12-2012' '17-09-2012' '02-06-2013' '21-12-2012'
 '01-11-2013' '24-07-2013' '15-12-2013' '11-10-2012' '02-08-2012'
 '20-12-2012' '09-01-2014']

In [93]:
#eğitim sütunu sıralı bir anlam taşıdığından map ile dönüştürdük
education_map={
    'Basic':0,
    '2n':1,
    'Graduation':2,
    'Master':3,
    'PhD':4
}
data['education_numeric']=data['Education'].map(education_map)
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response,education_numeric
0,5524,1957,Graduation,Single,58138,0,0,04-09-2012,58,635,...,0,0,0,0,0,0,3,11,1.0,2
1,2174,1954,Graduation,Single,46344,1,1,08-03-2014,38,11,...,0,0,0,0,0,0,3,11,0.0,2
2,4141,1965,Graduation,Together,71613,0,0,21-08-2013,26,426,...,0,0,0,0,0,0,3,11,0.0,2
3,6182,1984,Graduation,Together,26646,1,0,10-02-2014,26,11,...,0,0,0,0,0,0,3,11,0.0,2
4,5324,1981,PhD,Married,58293,1,0,19-01-2014,94,173,...,0,0,0,0,0,0,3,11,0.0,4

In [94]:
#Marital_Status doğrudan sıralı bir  anlam taşımaz one hot encoding ile dönüştürmek daha doğrudur
data=pd.get_dummies(data,columns=['Marital_Status'],drop_first=True,dtype=int)
data.head()

,ID,Year_Birth,Education,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,...,Response,education_numeric,Marital_Status_Alone,Marital_Status_Cycle,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Together,Marital_Status_Widow,Marital_Status_YOLO
0,5524,1957,Graduation,58138,0,0,04-09-2012,58,635,88,...,1.0,2,0,0,0,0,1,0,0,0
1,2174,1954,Graduation,46344,1,1,08-03-2014,38,11,1,...,0.0,2,0,0,0,0,1,0,0,0
2,4141,1965,Graduation,71613,0,0,21-08-2013,26,426,49,...,0.0,2,0,0,0,0,0,1,0,0
3,6182,1984,Graduation,26646,1,0,10-02-2014,26,11,4,...,0.0,2,0,0,0,0,0,1,0,0
4,5324,1981,PhD,58293,1,0,19-01-2014,94,173,43,...,0.0,4,0,0,0,1,0,0,0,0

In [95]:
#Income kısmını objectten numerice çevirelim
#datasette income olamayan kısımlar var bunları null atadık sonra bunları ortalama değerle doldurabilirdik ama sadece 3 değer olduğundan bu dataları sildik 
data['Income']=pd.to_numeric(data['Income'],errors='coerce')
data = data.dropna(subset=['Income']) 
data.head()

,ID,Year_Birth,Education,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,...,Response,education_numeric,Marital_Status_Alone,Marital_Status_Cycle,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Together,Marital_Status_Widow,Marital_Status_YOLO
0,5524,1957,Graduation,58138.0,0,0,04-09-2012,58,635,88,...,1.0,2,0,0,0,0,1,0,0,0
1,2174,1954,Graduation,46344.0,1,1,08-03-2014,38,11,1,...,0.0,2,0,0,0,0,1,0,0,0
2,4141,1965,Graduation,71613.0,0,0,21-08-2013,26,426,49,...,0.0,2,0,0,0,0,0,1,0,0
3,6182,1984,Graduation,26646.0,1,0,10-02-2014,26,11,4,...,0.0,2,0,0,0,0,0,1,0,0
4,5324,1981,PhD,58293.0,1,0,19-01-2014,94,173,43,...,0.0,4,0,0,0,1,0,0,0,0

In [96]:
#Teenhome değerini sayısal veriye dönüştürelim
data['Teenhome']=pd.to_numeric(data['Teenhome'])
data.head()

,ID,Year_Birth,Education,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,...,Response,education_numeric,Marital_Status_Alone,Marital_Status_Cycle,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Together,Marital_Status_Widow,Marital_Status_YOLO
0,5524,1957,Graduation,58138.0,0,0,04-09-2012,58,635,88,...,1.0,2,0,0,0,0,1,0,0,0
1,2174,1954,Graduation,46344.0,1,1,08-03-2014,38,11,1,...,0.0,2,0,0,0,0,1,0,0,0
2,4141,1965,Graduation,71613.0,0,0,21-08-2013,26,426,49,...,0.0,2,0,0,0,0,0,1,0,0
3,6182,1984,Graduation,26646.0,1,0,10-02-2014,26,11,4,...,0.0,2,0,0,0,0,0,1,0,0
4,5324,1981,PhD,58293.0,1,0,19-01-2014,94,173,43,...,0.0,4,0,0,0,1,0,0,0,0

In [97]:
#DtCustomer sütunu için gün bazlı bir hesaplama yapacağız müşteri kaç gündür kayıtlı onu incelemek için elimizde sadece giriş tarihi olduğundan en mantıklısı budur
data['Dt_Customer']=pd.to_datetime(data['Dt_Customer'],format='%d-%m-%Y') #datetimeye göre formatladık
data['Day_Since_Registration']=(pd.to_datetime('today')-data['Dt_Customer']).dt.days #gün sayısını sütun olarak ekledik 
data.head()

,ID,Year_Birth,Education,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,...,education_numeric,Marital_Status_Alone,Marital_Status_Cycle,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Together,Marital_Status_Widow,Marital_Status_YOLO,Day_Since_Registration
0,5524,1957,Graduation,58138.0,0,0,2012-09-04,58,635,88,...,2,0,0,0,0,1,0,0,0,4632
1,2174,1954,Graduation,46344.0,1,1,2014-03-08,38,11,1,...,2,0,0,0,0,1,0,0,0,4082
2,4141,1965,Graduation,71613.0,0,0,2013-08-21,26,426,49,...,2,0,0,0,0,0,1,0,0,4281
3,6182,1984,Graduation,26646.0,1,0,2014-02-10,26,11,4,...,2,0,0,0,0,0,1,0,0,4108
4,5324,1981,PhD,58293.0,1,0,2014-01-19,94,173,43,...,4,0,0,0,1,0,0,0,0,4130

In [98]:
#şimdi dönüştürdüğümüz sütunları veri setinden çıkaralım 
data.drop(columns=['ID','Education','Dt_Customer'],axis=1,inplace=True) #ID düşürüldü bi anlam ifade etmiyor 
data.head()

,Year_Birth,Income,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,...,education_numeric,Marital_Status_Alone,Marital_Status_Cycle,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Together,Marital_Status_Widow,Marital_Status_YOLO,Day_Since_Registration
0,1957,58138.0,0,0,58,635,88,546,172,88,...,2,0,0,0,0,1,0,0,0,4632
1,1954,46344.0,1,1,38,11,1,6,2,1,...,2,0,0,0,0,1,0,0,0,4082
2,1965,71613.0,0,0,26,426,49,127,111,21,...,2,0,0,0,0,0,1,0,0,4281
3,1984,26646.0,1,0,26,11,4,20,10,3,...,2,0,0,0,0,0,1,0,0,4108
4,1981,58293.0,1,0,94,173,43,118,46,27,...,4,0,0,0,1,0,0,0,0,4130

In [ ]:
data.info() #tüm datalar sayısal değerlere dönüştürürldü
print(data.isnull().sum().sum()) #null değer yok veri temizliği tamamlandır

<class 'pandas.core.frame.DataFrame'>
Index: 2016 entries, 0 to 2039
Data columns (total 35 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Year_Birth               2016 non-null   int64
 1   Income                   2016 non-null   float64
 2   Kidhome                  2016 non-null   int64
 3   Teenhome                 2016 non-null   int64
 4   Recency                  2016 non-null   int64
 5   MntWines                 2016 non-null   int64
 6   MntFruits                2016 non-null   int64
 7   MntMeatProducts          2016 non-null   int64
 8   MntFishProducts          2016 non-null   int64
 9   MntSweetProducts         2016 non-null   int64
 10  MntGoldProds             2016 non-null   int64
 11  NumDealsPurchases        2016 non-null   int64
 12  NumWebPurchases          2016 non-null   int64
 13  NumCatalogPurchases      2016 non-null   int64
 14  NumStorePurchases        2016 non-null   int64
 15  NumWebVisitsMonth        2016 non-null   int64
 16  AcceptedCmp3             2016 non-null   int64
 17  AcceptedCmp4             2016 non-null   int64
 18  AcceptedCmp5             2016 non-null   int64
 19  AcceptedCmp1             2016 non-null   int64
 20  AcceptedCmp2             2016 non-null   int64
 21  Complain                 2016 non-null   int64
 22  Z_CostContact            2016 non-null   int64
 23  Z_Revenue                2016 non-null   int64
 24  Response                 2016 non-null   float64
 25  education_numeric        2016 non-null   int64
 26  Marital_Status_Alone     2016 non-null   int32
 27  Marital_Status_Cycle     2016 non-null   int32
 28  Marital_Status_Divorced  2016 non-null   int32
 29  Marital_Status_Married   2016 non-null   int32
 30  Marital_Status_Single    2016 non-null   int32
 31  Marital_Status_Together  2016 non-null   int32
 32  Marital_Status_Widow     2016 non-null   int32
 33  Marital_Status_YOLO      2016 non-null   int32
 34  Day_Since_Registration   2016 non-null   int64
dtypes: float64(2), int32(8), int64(25)
memory usage: 504.0 KB
0

In [ ]:
#scale edilecek,test_split,model eğitimi,sonuçlar ve görselleştirme eklenecek